INSERT INTO movie VALUES(
  null,
  "变身特工",
  "兰斯与沃尔特，前者是超级炫酷又迷人的间谍，后者负责发明兰斯使用的各种炫酷小道具。危难当头，他们必须团结一致才能拯救世界.",
  "动作/喜剧/科幻/动画",
  "2020-01-03",
  "7.6",
  "BD",
  "英语",
  "尼克·布鲁诺/特洛伊·奎安",
  "美国",
  0,
  "102分钟",
  "bianShenTeGong.webp",
  "bianShenTeGong.mp4",
  "2020-4-7"
);
INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "喋血战士",
  -- 电影介绍
  "电影根据勇士漫画改编，讲述由范·迪塞尔扮演的士兵雷·加里森在战斗中意外阵亡，被RST公司利用尖端纳米技术起死回生，变身即时自愈、媲美超级电脑的超级英雄——喋血战士。苏醒的他执着于脑海中残存的记忆碎片，踏上为爱妻的复仇之路，却发现自己竟无法分清真实与虚幻...",
  -- 电影类型 科幻,战斗,动作
  "动作/科幻",
  -- 电影上映时间
  "2020待定",
  -- 电影分数,0~10分
  "5.5",
  -- 电影语言类型 BD 国语
  "BD",
  -- 电影语言 英语 日语 国语
  "英语",
   -- 电影导演名字
   "戴夫·威尔逊",
   -- 拍摄国家 
   "美国/中国",
   -- 电影播放次数
   0,
  -- 电影时长 xxx分钟
  "109分钟",
  -- 电影图片
  "DieXueZhanShi.webp",
  -- 电影资源地址
  "DieXueZhanShi.mp4",
  -- 资源更新时间
  "2019-6-7"
);

-- 2
INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "绝地战警:疾速追击",
  -- 电影介绍
  '曾制作《珍珠港》、《壮志凌云》、《加勒比海盗》系列等爆款电影的好莱坞金牌制片人全新倾力打造的《绝地战警：疾速追击》，讲述了迈阿密警员麦克（威尔·史密斯饰）遭遇神秘黑帮势力的暗杀伏击，为了迎战势力庞大火力惊人的黑帮分子，解决隐藏在暗处的危机，麦克找回曾经的搭档马库斯（马丁·劳伦斯饰），“嘴炮二人组”再度集结开启沙雕模式，不仅时刻上演逗比互怼，更在迈阿密街头与黑帮展开空前绝后的飙车枪战大戏。这对最佳搭档究竟能否在枪林弹雨下突出重围，找出幕后黑手完成绝地反杀?',
  -- 电影类型 科幻,战斗,动作
  "喜剧/动作/犯罪",
  -- 电影上映时间
  "2020待定",
  -- 电影分数,0~10分
  "5.9",
  -- 电影语言类型 BD 国语
  "BD",
  -- 电影语言 英语 日语 国语
  "英语",
   -- 电影导演名字
   "阿迪尔·埃尔·阿比 / 比拉勒·法拉赫",
   -- 拍摄国家 
   "美国",
   -- 电影播放次数
   0,
  -- 电影时长 xxx分钟
  "124分钟",
  -- 电影图片
  "JueDiZhanJing_JiShuZuiJi.webp",
  -- 电影资源地址
  "JueDiZhanJing_JiShuZuiJi.mp4",
  -- 资源更新时间
  "2020-4-7"
);
INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "哈莉·奎因:猛禽小队",
  -- 电影介绍
  '你听过一个有关警察、歌手、神经病和黑手党公主的故事吗？<猛禽小队和哈莉·奎茵>是一个只有哈莉·奎茵本人才能讲出来的超乎寻常的奇妙传奇。哥谭市最为凶残自大的恶棍罗曼·赛恩尼斯和他狂热的手下萨斯为了寻找一个年轻女孩卡斯，将这座城市翻了个底朝天。哈莉、女猎手、黑金丝雀和蕾妮·蒙托亚不期而遇，看似违和的四人组不得不团结一致、携手作战，才有可能打败罗曼.',
  -- 电影类型 科幻,战斗,动作
  "动作/犯罪/冒险",
  -- 电影上映时间
  "2020-02-07",
  -- 电影分数,0~10分
  "5.8",
  -- 电影语言类型 BD 国语
  "BD",
  -- 电影语言 英语 日语 国语
  "英语",
   -- 电影导演名字
   "阎羽茜",
   -- 拍摄国家 
   "美国",
   -- 电影播放次数
   0,
  -- 电影时长 xxx分钟
  "109分钟",
  -- 电影图片
  "HaLiKuiEn_MengQinXiaoDui.webp",
  -- 电影资源地址
  "HaLiKuiEn_MengQinXiaoDui.mp4",
  -- 资源更新时间
  "2020-4-7"
);

INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "狩猎",
  -- 电影介绍
  '12个陌生人在空地上醒来。他们不知道自己在哪里，或者是如何到达这里的。他们不知道他们已经被选中，为了一个非常特殊的目的——捕猎。',
  -- 电影类型 科幻,战斗,动作
  "动作/惊悚",
  -- 电影上映时间
  "2020-03-13",
  -- 电影分数,0~10分
  "7.2",
  -- 电影语言类型 BD 国语
  "BD",
  -- 电影语言 英语 日语 国语
  "英语",
   -- 电影导演名字
   "克雷格·卓贝",
   -- 拍摄国家 
   "美国",
   -- 电影播放次数
   0,
  -- 电影时长 xxx分钟
  "90分钟",
  -- 电影图片
  "ShouLie.webp",
  -- 电影资源地址
  "ShouLie.mp4",
  -- 资源更新时间
  "2020-4-7"
);

INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "天·火",
  -- 电影介绍
  '天火岛美得如同世外桃源，几乎让人忘记它位于“Ring of Fire”——全球知名的环太平洋火山带。年轻的地质学家李晓梦为了研发首个火山监测系统“朱雀”，带着团队来到了这里。李晓梦的父亲、隐退多年的火山专家李文涛得知后赶到火山口，力图劝说她离开。与此同时，探险专家正楠在美轮美奂的水下溶洞潜水，准备给女友佳慧一个浪漫的求婚……火山喷发了，这些人的命运纠结在一起。为了看见明天的太阳，他们必须与过去和解，合力为自己也为众生在绝境中寻找一条生路。 这是一个关于爱与勇气、选择与放弃、自救与他救的中国式英雄的故事。',
  -- 电影类型 科幻,战斗,动作
  "动作/冒险/灾难",
  -- 电影上映时间
  "2019-12-12",
  -- 电影分数,0~10分
  "4.5",
  -- 电影语言类型 BD 国语
  "国语",
  -- 电影语言 英语 日语 国语
  "国语",
   -- 电影导演名字
   "西蒙·韦斯特",
   -- 拍摄国家 
   "中国大陆",
   -- 电影播放次数
   0,
  -- 电影时长 xxx分钟
  "97分钟",
  -- 电影图片
  "TianHuo.webp",
  -- 电影资源地址
  "TianHuo.mp4",
  -- 资源更新时间
  "2020-4-7"
);


INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "刺猬索尼克",
  -- 电影介绍
  '改编自世嘉公司出品的风靡全球的电子游戏。电影讲述了拥有音速奔跑能力的刺猬索尼克在地球上展开新生活的故事。索尼克和他的新朋友汤姆（詹姆斯·麦斯登 饰）联手保护地球，阻止邪恶的蛋头博士（金·凯瑞 饰）统治世界的计划。这部适合全家观看的电影还邀请了迪卡·桑普特参演，本·施瓦茨为索尼克配音。',
  -- 电影类型 科幻,战斗,动作
  "喜剧/动作/动画/冒险",
  -- 电影上映时间
  "2020待定",
  -- 电影分数,0~10分
  "6.1",
  -- 电影语言类型 BD 国语
  "BD",
  -- 电影语言 英语 日语 国语
  "英语",
   -- 电影导演名字
   "杰夫·福勒",
   -- 拍摄国家 
   "加拿大/日本/美国",
   -- 电影播放次数
   0,
  -- 电影时长 xxx分钟
  "99分钟",
  -- 电影图片
  "CiWeiSuoNiKe.webp",
  -- 电影资源地址
  "CiWeiSuoNiKe.mp4",
  -- 资源更新时间
  "2020-4-7"
);

INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "星球大战9：天行者崛起",
  -- 电影介绍
  '本片为2017年电影《星球大战：最后的绝地武士》的续集，“星球大战后传三部曲”的第三部作品，同时是“天行者传奇”的第九部作品以及最终章。在卢克·天行者化为绝地英灵的一年后，残存的抵抗势力将再次面对第一秩序。同时，绝地和西斯之间的大战将天行者的传奇带到最后。',
  -- 电影类型 科幻,战斗,动作
  "动作/科幻/冒险",
  -- 电影上映时间
  "2019-12-18",
  -- 电影分数,0~10分
  "6.4",
  -- 电影语言类型 BD 国语
  "BD",
  -- 电影语言 英语 日语 国语
  "英语",
   -- 电影导演名字
   "J·J·艾布拉姆斯",
   -- 拍摄国家 
   "美国",
   -- 电影播放次数
   0,
  -- 电影时长 xxx分钟
  "142分钟",
  -- 电影图片
  "XingZhan9.webp",
  -- 电影资源地址
  "XingZhan9.mp4",
  -- 资源更新时间
  "2020-4-7"
);

INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "侏罗纪世界2",
  -- 电影介绍
  '自侏罗纪世界的骚乱以来，种类繁多的恐龙在努布拉岛度过了三年无拘无束的时光。然而该岛火山活动频繁，随时有喷发的危险。致力于恐龙保护的克莱尔·戴宁（布莱丝·达拉斯·霍华德 Bryce Dallas Howard 饰）受到班杰明•洛克伍德的邀请。班杰明及其下属伊莱·米尔斯（拉菲·斯波 Rafe Spall 饰）希望她和相关技术人员前往努布拉岛拯救那里的恐龙，并将它们安置在新的栖息地。受到感染的克莱尔设法找来欧文（克里斯·帕拉特 Chris Pratt 饰）一同前往，欧文则希望救出他亲手驯养的迅猛龙小蓝。当他们踏足这座隔绝之岛时，却发现事情没那么简单。火山蠢蠢欲动，随时爆发，而混乱之中丑恶的阴谋悄然酝酿……',
  -- 电影类型 科幻,战斗,动作
  "动作/科幻/冒险",
  -- 电影上映时间
  "2018-06-15",
  -- 电影分数,0~10分
  "6.7",
  -- 电影语言类型 BD 国语
  "BD",
  -- 电影语言 英语 日语 国语
  "英语",
   -- 电影导演名字
   "J·A·巴亚纳",
   -- 拍摄国家 
   "美国",
   -- 电影播放次数
   0,
  -- 电影时长 xxx分钟
  "128分钟",
  -- 电影图片
  "zhuLuoJiShiJie2.webp",
  -- 电影资源地址
  "zhuLuoJiShiJie2.mp4",
  -- 资源更新时间
  "2020-4-7"
);


INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "勇敢者游戏2：再战巅峰",
  -- 电影介绍
  '四名勇敢者再次穿越回到险象环生的游戏世界中，开启全新冒险。与上次不同的是，变身勇石博士 (道恩·强森 饰) 的是斯潘瑟的外公，外公的好友则变身为语言学家 (凯文· 哈特 饰)，高大威猛的弗里奇变成了中年发福地质学家 (杰克·布莱克 饰)，只有学霸玛莎依旧化身性感打女 (凯伦·吉兰 饰)，斯潘瑟和贝瑟尼却不知所踪。为营救消失的伙伴，四人必须进入全面失控的未知世界，面对难度爆表危险重重的致命关卡，强森领队挑战极限玩命闯关。山崩石裂的险境中命悬一线，与突如其来的凶猛野兽死战到底，他们唯有绷紧神经并肩作战，才能通过生死考验逃出生天。一场惊险刺激又充满惊喜的冒险之旅即将展开！',
  -- 电影类型 科幻,战斗,动作
  "喜剧/动作/奇幻/冒险",
  -- 电影上映时间
  "2019-12-06",
  -- 电影分数,0~10分
  "6.0",
  -- 电影语言类型 BD 国语
  "BD",
  -- 电影语言 英语 日语 国语
  "英语",
   -- 电影导演名字
   "杰克·卡斯丹",
   -- 拍摄国家 
   "美国",
   -- 电影播放次数
   0,
  -- 电影时长 xxx分钟
  "122分钟",
  -- 电影图片
  "YongGanZheDeYouXi2.webp",
  -- 电影资源地址
  "YongGanZheDeYouXi2.mp4",
  -- 资源更新时间
  "2020-4-7"
);

INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "侏罗纪世界",
  -- 电影介绍
  '21世纪，曾经诞生过第一只恐龙的努布拉岛，在经历了一系列的惨剧之后迎来新的时代，如今这里经马斯拉尼之手建成了规模宏大的主题公园“侏罗纪世界”，数量繁多的远古生物每天都吸引数以万计的游客前来一饱眼福。为了吸引更多的游客，公司授意创意实验室采用不同动物的基因创造了集力量、速度和智慧于一体的暴虐霸王龙。作为负责人的克莱尔（布莱丝·达拉斯·霍华德 Bryce Dallas Howard 饰）原打算请专门负责迅猛龙的欧文·格雷迪（克里斯·普拉特 Chris Pratt 饰）评估暴虐霸王龙的防护设施，谁知这头可怕的怪物竟然骗过了精密仪器的监视和人类的眼睛，以迅雷不及掩耳的速度逃到了外面，随后对所见的一切生物展开了无差别的血腥屠杀。
　　原本快乐祥和的公园乱作一团，克莱尔必须深入危险之地救出两个被困的外甥，而欧文则不可避免地带着他的迅猛龙猎人团队迎战史无前例的的可怕对手…… ',
  -- 电影类型 科幻,战斗,动作
  "动作/科幻/冒险",
  -- 电影上映时间
  "2015-06-10",
  -- 电影分数,0~10分
  "7.9",
  -- 电影语言类型 BD 国语
  "BD",
  -- 电影语言 英语 日语 国语
  "英语",
   -- 电影导演名字
  "科林·特雷沃罗",
   -- 拍摄国家 
  "美国/中国大陆",
   -- 电影播放次数
  0,
  -- 电影时长 xxx分钟
  "124分钟",
  -- 电影图片
  "侏罗纪世界.webp",
  -- 电影资源地址
  "侏罗纪世界.mp4",
  -- 资源更新时间
  "2020-4-13"
);
INSERT INTO movie VALUES(
  null,
  -- 电影名字
  "流浪地球 ",
  -- 电影介绍
  '近未来，科学家们发现太阳急速衰老膨胀，短时间内包括地球在内的整个太阳系都将被太阳所吞没。为了自救，人类提出一个名为“流浪地球”的大胆计划，即倾全球之力在地球表面建造上万座发动机和转向发动机，推动地球离开太阳系，用2500年的时间奔往另外一个栖息之地。中国航天员刘培强（吴京 饰）在儿子刘启四岁那年前往国际空间站，和国际同侪肩负起领航者的重任。转眼刘启（屈楚萧 饰）长大，他带着妹妹朵朵（赵今麦 饰）偷偷跑到地表，偷开外公韩子昂（吴孟达 饰）的运输车，结果不仅遭到逮捕，还遭遇了全球发动机停摆的事件。为了修好发动机，阻止地球坠入木星，全球开始展开饱和式营救，连刘启他们的车也被强征加入。在与时间赛跑的过程中，无数的人前仆后继，奋不顾身，只为延续百代子孙生存的希望…… ',
  -- 电影类型 科幻,战斗,动作
  "科幻/冒险/灾难",
  -- 电影上映时间
  "2019-02-05",
  -- 电影分数,0~10分
  "7.9",
  -- 电影语言类型 BD 国语
  "国语",
  -- 电影语言 英语 日语 国语
  "国语",
   -- 电影导演名字
  "郭帆",
   -- 拍摄国家 
  "中国大陆",
   -- 电影播放次数
  0,
  -- 电影时长 xxx分钟
  "125分钟",
  -- 电影图片
  "流浪地球.webp",
  -- 电影资源地址
  "流浪地球.mp4",
  -- 资源更新时间
  "2020-4-13"
);

